%Το συνολικό μου κεφάλαιο.
capital=100000;
disp(['Το συνολικό κεφάλαιο μου αρχικά είναι: ' , num2str(capital) , ' δολλάρια. '])
disp(' ')

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
capital2=100000;
disp('--------------------------------------------------------------------------------------------------------------------------------------------------------')
disp(['Το συνολικό κεφάλαιο μου αρχικά είναι: ' , num2str(capital2) , ' δολλάρια. '])
disp('--------------------------------------------------------------------------------------------------------------------------------------------------------')
disp(' ')
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%


%Το διαθέσιμο κεφάλαιο που θέλω να επενδύσω για αυτήν την στρατιγική είναι:
available=(10/100)*capital;
disp(['Απο το συνολικό μου κεφάλαιο θα επενδύσω μόνο: ' , num2str(available),  ' δολλάρια. '])
disp(' ')

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
available2=(10/100)*capital2;
disp('--------------------------------------------------------------------------------------------------------------------------------------------------------')
disp(['Απο το συνολικό μου κεφάλαιο θα επενδύσω μόνο: ' , num2str(available2),  ' δολλάρια. '])
disp('--------------------------------------------------------------------------------------------------------------------------------------------------------')
disp(' ')
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

 
%Αρχικά θα εφαρμόσω την στρατιγική μου με βάση τις τιμές που παίρνω όταν
%τρέχω την συνάρτηση MACD  για τις τιμές κλεισίματος της μετοχής microsoft.

%Τις τιμές των μετοχών κλεισίματος για τον δείκτη MACD τις παίρνω απο την
%εντολή:
table_macd=macd(msft(:,6));

%Τις τιμές μου για το πόσο αξίζουν οι μετοχές μου σε δολλάρια τις παίρνω από τον πίνακα
table_withValuesOfClosedStocks=msft(:,6);

%Η τιμή της trigger line είναι ίση με το μηδέν,όπως απικονίστηκε και στο
%διάγραμμα Figure1

trigger_line=0;


%Κάθε φορά που ο δείκτης macd για τις μετοχές είναι μεγαλύτερος απο την τιμή της trigger line...αγοράζω

%Σε διαφορετική περίπτωση εάν  ο δείκτης είναι μικρότερος απο την τιμή της trigger line....πουλάω


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%'Επειτα θα εφαρμόσω την στρατιγική μου με βάση τις τιμές που παίρνω όταν
%τρέχω την συνάρτηση RSI  για τις τιμές κλεισίματος της μετοχής microsoft.
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%Τις τιμές των μετοχών κλεισίματος για τον δείκτη RSI τις παίρνω απο την
%εντολή:
table2_rsi=rsindex(msft(:,6));
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%Τις τιμές μου για το πόσο αξίζουν οι μετοχές μου σε δολλάρια τις παίρνω από τον πίνακα
table2_withValuesOfClosedStocks=msft(:,6);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%Εδώ καθορίζω δύο τιμές με βάσει τις οποίες αγοράζω ή πουλάω αντίστοιχα
% Την πρώτη γραμμη την ονομάζω rsiUP=70 και την άλλη rsiDOWN=20 όπως φένεται και στο διάγραμμα Figure1
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

rsiDOWN=20;%Ανοδική διάσπαση της γραμμής συνεπάγεται αγορά.
rsiUP=70;%Καθοδική διάσπαση της γραμμής συνεπάγεται πώληση.



%Το πόσες μετοχές θα αγοράσω το καθορίζω τυχαία απο την συνάρτηση 
% randi() που μου δίνει το matlab.Εγώ καθορίζω ότι η ποσότητα των μετοχών
% προς αγοραπωλησία θα κειμένεται απο 1-100 μετοχές την φορά.


%παράδειγμα λειτουργίας της randi()
%  example=randi([1,100],1,1);

for i=1:10
    
    totalNumberOfStocks=randi([1,100],1,1);%Ποσότητα των μετοχών που θα αγοράσω ή θα πουλήσω.
    
    disp(['θα αγοράσω ή θα πουλήσω: ' , num2str(totalNumberOfStocks),  ' μετοχές. '])
    disp(' ')

    
    whichStock=randi([1,251],1,1);%Επιλέγω τυχαία μία μετοχή απο το διάστημα 1-251...όσες είναι και το διάστημα σε μέρες που εξετάζω την τιμή της μετοχής.
    
    priceOfStocks=table_withValuesOfClosedStocks(whichStock)*totalNumberOfStocks;%Αξία μετοχών προς αγοραπωλησία.
    
    disp(['Στην ', num2str(i), 'η επανάληψη..'])

    if table_macd(whichStock)>trigger_line
        %αγοράζω
        available=available-(priceOfStocks);
        disp(['Αγοράζω...οπότε το διαθέσιμο κεφάλαιο μου θα μειωθεί και θα φτάσει στα : ', num2str(available), ' δολλάρια. '])
        disp(' ')

        
    elseif table_macd(whichStock)<trigger_line
        %πουλάω
        available=available+(priceOfStocks);
        disp(['Πουλάω...οπότε το διαθέσιμο κεφάλαιο μου θα αυξηθεί και θα φτάσει στα : ', num2str(available), ' δολλάρια. '])
        disp(' ')


    else
        %Το διαθέσιμο ποσό(available) παραμένει σταθερό στην περίπτωση που
        %πάρω την τιμή NaN(Not a Number) απο τον πίνακα table_macd
        available=available+0;
        disp(['Το διαθέσιμο ποσό παραμένει σταθερό στα : ', num2str(available),  ' δολλάρια. '])
        disp(' ')


    end
    
    
    if (table2_rsi(whichStock)>rsiDOWN && table2_rsi(whichStock-1)<rsiDOWN)
        %αγοράζω
        available2=available2-(priceOfStocks);
        disp('----------------------------------------------------------------------------------------------------------------')
        disp(['Αγοράζω...οπότε το διαθέσιμο κεφάλαιο μου θα μειωθεί και θα φτάσει στα : ', num2str(available2), ' δολλάρια. '])
        disp('----------------------------------------------------------------------------------------------------------------')
        disp(' ')
        
    elseif (table2_rsi(whichStock)<rsiUP && table2_rsi(whichStock-1)<rsiUP)
        %πουλάω
        available2=available2+(priceOfStocks);
        disp('----------------------------------------------------------------------------------------------------------------')
        disp(['Πουλάω...οπότε το διαθέσιμο κεφάλαιο μου θα αυξηθεί και θα φτάσει στα : ', num2str(available2), ' δολλάρια. '])
        disp('----------------------------------------------------------------------------------------------------------------')
        disp(' ')
    else
        %Το διαθέσιμο ποσό(available2) παραμένει σταθερό στην περίπτωση που
        %πάρω την τιμή NaN(Not a Number) απο τον πίνακα rsi_macd
        available2=available2+0;
        disp('----------------------------------------------------------------------------------------------------------------')
        disp(['Το διαθέσιμο ποσό παραμένει σταθερό στα : ', num2str(available2),  ' δολλάρια. '])
        disp('----------------------------------------------------------------------------------------------------------------')
        disp(' ')
        
    end

    
    
    
end


    disp(' ')
    disp(' ')
    disp(['Τελικά μετά απο τις αγοραπωλησίες ενώ είχα 10000 δολλάρια σαν διαθέσιμο....τώρα έχω: ' , num2str(available), ' δολλάρια διαθέσιμα για μελλοντική επένδυση'])
    disp(' ')
    capital=90000+available;%Το τελικό ποσό του κεφαλαίου μου μετά τις 10 αγοραπωλησίες.
    
    disp(['Το τελικό ΣΥΝΟΛΙΚΟ ποσό του κεφαλαίου μου μετά τις 10 αγοραπωλησίες είναι :' ,num2str(capital), ' δολλάρια. ']) 
    disp(' ')
     %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    disp(' ')
    disp(' ')
    disp('--------------------------------------------------------------------------------------------------------------------------------------------------------')
    disp(['Τελικά μετά απο τις αγοραπωλησίες ενώ είχα 10000 δολλάρια σαν διαθέσιμο....τώρα έχω: ' , num2str(available2), ' δολλάρια διαθέσιμα για μελλοντική επένδυση'])
    disp('--------------------------------------------------------------------------------------------------------------------------------------------------------')

    disp(' ')
    capital2=90000+available2;%Το τελικό ποσό του κεφαλαίου μου μετά τις 10 αγοραπωλησίες.
    disp('--------------------------------------------------------------------------------------------------------------------------------------------------------')
    disp(['Το τελικό ΣΥΝΟΛΙΚΟ ποσό του κεφαλαίου μου μετά τις 10 αγοραπωλησίες είναι :' ,num2str(capital2), ' δολλάρια. ']) 
    disp('--------------------------------------------------------------------------------------------------------------------------------------------------------')
    disp(' ')

    
    
    if (capital>100000)
        disp(['Στο τέλος των αγοροπωλησιών έχω κέρδος : ', num2str(capital-100000), ' δολλάρια. '])
        disp(' ')

    elseif(capital<100000)
        disp(['Στο τέλος των αγοροπωλησιών έχω ζημία : ', num2str(100000-capital), ' δολλάρια. '])
        disp(' ')


    else
        disp('Το κεφάλαιο μου δεν έχει αλλάξει')
        disp(' ')

    end 
    
    if (capital2>100000)
        disp('--------------------------------------------------------------------------------------------------------------------------------------------------------')
        disp(['Στο τέλος των αγοροπωλησιών έχω κέρδος : ', num2str(capital2-100000), ' δολλάρια. '])
        disp('--------------------------------------------------------------------------------------------------------------------------------------------------------')
        disp(' ')

    elseif(capital2<100000)
        disp('--------------------------------------------------------------------------------------------------------------------------------------------------------')
        disp(['Στο τέλος των αγοροπωλησιών έχω ζημία : ', num2str(100000-capital2), ' δολλάρια. '])
        disp('--------------------------------------------------------------------------------------------------------------------------------------------------------')
        disp(' ')


    else
        disp('--------------------------------------------------------------------------------------------------------------------------------------------------------')
        disp('Το κεφάλαιο μου δεν έχει αλλάξει')
        disp('--------------------------------------------------------------------------------------------------------------------------------------------------------')
        disp(' ')
    end 
    
    disp('####################################################################################')
    disp('Μετά από την δοκιμή των δύο στρατηγικών πάνω στα ίδια δεδομένα διαπιστώνουμε:')
    if capital>capital2
        disp('Η στρατιγική του δείκτη MACD είναι πιό αποδοτική')
    elseif capital<capital2
           disp('Η στρατιγική του δείκτη RSI είναι πιό αποδοτική')
    else
          disp('Οι στρατηγικές είναι ισοδύναμες')
    end
    disp('####################################################################################')





